{
  "trueFalse": [
    { "id": 1, "text": "Information is processed data.", "translationAr": "المعلومات هي بيانات تمت معالجتها.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Data is the raw facts. Once data is organized, structured, or processed to provide meaning, it becomes information.", "explanationAr": "البيانات هي حقائق خام. بمجرد تنظيم البيانات أو هيكلتها أو معالجتها لإعطاء معنى، فإنها تصبح معلومات." },
    { "id": 2, "text": "Metadata are data that describe the properties of other data.", "translationAr": "البيانات الوصفية هي بيانات تصف خصائص بيانات أخرى.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Metadata provides context such as data types, field lengths, and constraints, effectively acting as a data dictionary.", "explanationAr": "توفر البيانات الوصفية سياقاً مثل أنواع البيانات وأطوال الحقول والقيود، وتعمل فعلياً كقاموس بيانات." },
    { "id": 3, "text": "Databases were developed as the first application of computers to data processing.", "translationAr": "تم تطوير قواعد البيانات كأول تطبيق للحواسيب لمعالجة البيانات.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "File processing systems were common before database systems emerged. Databases were developed later to solve the limitations of file systems.", "explanationAr": "كانت أنظمة معالجة الملفات شائعة قبل ظهور أنظمة قواعد البيانات. تم تطوير قواعد البيانات لاحقاً لحل قيود أنظمة الملفات." },
    { "id": 4, "text": "File processing systems have been replaced by database systems in most critical business applications today.", "translationAr": "تم استبدال أنظمة معالجة الملفات بأنظمة قواعد البيانات في معظم تطبيقات الأعمال الهامة اليوم.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Modern businesses require central data management, redundancy control, and improved security, which databases provide.", "explanationAr": "تتطلب الشركات الحديثة إدارة مركزية للبيانات والتحكم في التكرار وتحسين الأمان، وهو ما توفره قواعد البيانات." },
    { "id": 5, "text": "Unplanned duplicate data files are the rule rather than the exception in file processing systems.", "translationAr": "ملفات البيانات المكررة غير المخطط لها هي القاعدة وليست الاستثناء في أنظمة معالجة الملفات.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Since each application typically maintains its own files in this approach, data is often duplicated across different departments.", "explanationAr": "بما أن كل تطبيق يحتفظ عادةً بملفاته الخاصة في هذا النهج، فإن البيانات غالباً ما تتكرر عبر الأقسام المختلفة." },
    { "id": 6, "text": "Organizations that utilize the file processing approach spend only 20 percent of development time on maintenance.", "translationAr": "المنظمات التي تستخدم نهج معالجة الملفات تقضي 20 بالمائة فقط من وقت التطوير في الصيانة.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "In fact, file processing systems often require up to 80% of development time for maintenance due to data dependency and lack of flexibility.", "explanationAr": "في الواقع، غالباً ما تتطلب أنظمة معالجة الملفات ما يصل إلى 80% من وقت التطوير للصيانة بسبب تبعية البيانات ونقص المرونة." },
    { "id": 7, "text": "Many of the disadvantages of file processing systems can also be limitations of databases.", "translationAr": "العديد من عيوب أنظمة معالجة الملفات يمكن أن تكون أيضًا قيودًا لقواعد البيانات.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Issues like complexity, cost, and the need for skilled personnel are potential drawbacks even in database environments.", "explanationAr": "مشاكل مثل التعقيد والتكلفة والحاجة إلى موظفين مهرة هي عيوب محتملة حتى في بيئات قواعد البيانات." },
    { "id": 8, "text": "With the traditional file processing approach, each application shares data files, thus enabling much data sharing.", "translationAr": "مع نهج معالجة الملفات التقليدي، يشارك كل تطبيق ملفات البيانات، مما يتيح مشاركة البيانات بشكل كبير.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "The primary problem with file processing is data isolation; applications do not easily share data because they use different file formats.", "explanationAr": "المشكلة الأساسية في معالجة الملفات هي عزل البيانات؛ فالتطبيقات لا تشارك البيانات بسهولة لأنها تستخدم تنسيقات ملفات مختلفة." },
    { "id": 9, "text": "Development starts from scratch with the traditional file processing approach because new file formats, descriptions, and file access logic must be designed for each new program.", "translationAr": "يبدأ التطوير من الصفر مع نهج معالجة الملفات التقليدي بسبب ضرورة تصميم تنسيقات ملفات وأوصاف ومنطق وصول لملفات جديد لكل برنامج جديد.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "This is called program-data dependence, where the code depends tightly on how the data is physically stored.", "explanationAr": "يسمى هذا اعتماد البيانات على البرنامج، حيث يعتمد الكود بشكل أساسي على كيفية تخزين البيانات ماديًا." },
    { "id": 10, "text": "A data model is a graphical system used to capture the nature and relationships among data.", "translationAr": "نموذج البيانات هو نظام رسومي يستخدم لالتقاط طبيعة العلاقات بين البيانات.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "A 'Data Model' is more of a set of concepts; an 'Entity-Relationship Diagram (ERD)' is the graphical system used to represent it.", "explanationAr": "نموذج البيانات هو مجموعة من المفاهيم؛ أما 'مخطط علاقة الكيانات (ERD)' فهو النظام الرسومي المستخدم لتمثيله." },
    { "id": 11, "text": "A well‑structured database establishes the entities between relationships in order to derive the desired information.", "translationAr": "تنشئ قاعدة البيانات جيدة التنظيم الكيانات بين العلاقات من أجل اشتقاق المعلومات المطلوبة.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "Actually, a database establishes relationships *between* entities, not 'entities between relationships'.", "explanationAr": "في الواقع، تنشئ قاعدة البيانات علاقات *بين* الكيانات، وليس 'كيانات بين العلاقات'." },
    { "id": 12, "text": "A person is an example of an entity.", "translationAr": "الشخص هو مثال على كيان.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "An entity is a person, place, object, event, or concept about which data is maintained.", "explanationAr": "الكيان هو شخص أو مكان أو شيء أو حدث أو مفهوم يتم الاحتفاظ ببيانات عنه." },
    { "id": 13, "text": "The data that you are interested in capturing about an entity is called an instance.", "translationAr": "البيانات التي ترغب في التقاطها حول كيان ما تسمى حالة (instance).", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "An 'instance' refers to a single occurrence of an entity (like a specific student), whereas 'attributes' are the data capturing properties.", "explanationAr": "تشير 'الحالة' (instance) إلى حدوث فردي للكيان (مثل طالب معين)، بينما 'السمات' هي الخصائص التي تلتقط البيانات." },
    { "id": 14, "text": "A relational database establishes the relationships between entities by means of a common field.", "translationAr": "تنشئ قاعدة البيانات العلائقية العلاقات بين الكيانات عن طريق حقل مشترك.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Relationships are formed through foreign keys, which are fields in one table that reference primary keys in another.", "explanationAr": "تتشكل العلاقات من خلال المفاتيح الأجنبية، وهي حقول في جدول واحد تشير إلى المفاتيح الأساسية في جدول آخر." },
    { "id": 15, "text": "Separation of metadata from application programs that use the data is called data independence.", "translationAr": "فصل البيانات الوصفية عن برامج التطبيقات التي تستخدم البيانات يسمى استقلالية البيانات.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "This allows data structures to change without requiring changes to the application programs.", "explanationAr": "يسمح هذا بتغيير هياكل البيانات دون الحاجة إلى إجراء تغييرات على برامج التطبيقات." },
    { "id": 16, "text": "Data redundancy is used to establish relationships between data but is never used to improve database performance.", "translationAr": "يستخدم تكرار البيانات لإنشاء علاقات بين البيانات ولكن لا يستخدم أبدًا لتحسين أداء قاعدة البيانات.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "Controlled redundancy (denormalization) is sometimes used strategically to speed up queries.", "explanationAr": "يُستخدم التكرار المتحكم فيه (Denormalization) أحياناً بشكل استراتيجي لتسريع الاستعلامات." },
    { "id": 17, "text": "The E‑R model is used to construct a conceptual model.", "translationAr": "يستخدم نموذج E-R لبناء نموذج مفاهيمي.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Entity-Relationship modeling is the standard approach for conceptual database design.", "explanationAr": "نمذجة علاقة الكيانات هي النهج القياسي لتصميم قاعدة البيانات المفاهيمي." },
    { "id": 18, "text": "A business rule is a statement that defines or constrains some aspect of the business.", "translationAr": "قاعدة العمل هي عبارة تحدد أو تقيد جانبًا من جوانب العمل.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Business rules translate organizational policies into data requirements and constraints.", "explanationAr": "تترجم قواعد العمل سياسات المنظمة إلى متطلبات بيانات وقيود." },
    { "id": 19, "text": "One of the roles of a database analyst is to identify and understand rules that govern data.", "translationAr": "أحد أدوار محلل قاعدة البيانات هو تحديد وفهم القواعد التي تحكم البيانات.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Analysts must gather business rules to ensure the database accurately reflects business needs.", "explanationAr": "يجب على المحللين جمع قواعد العمل لضمان أن قاعدة البيانات تعكس بدقة احتياجات العمل." },
    { "id": 20, "text": "The intent of a business rule is to break down business structure.", "translationAr": "الهدف من قاعدة العمل هو تفكيك هيكل العمل.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "The intent is actually to enforce and support business structure and integrity.", "explanationAr": "الهدف في الواقع هو تطبيق ودعم هيكل العمل وسلامته." },
    { "id": 21, "text": "Enforcement of business rules can be automated through the use of software tools that can interpret the rules and enforce them.", "translationAr": "يمكن أتمتة إنفاذ قواعد العمل من خلال استخدام أدوات برمجية يمكنها تفسير القواعد وإنفاذها.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Modern DBMS systems often have built-in triggers and constraints to automatically enforce these rules.", "explanationAr": "غالباً ما تحتوي أنظمة إدارة قواعد البيانات الحديثة على مشغلات (Triggers) وقيود مدمجة لإنفاذ هذه القواعد تلقائياً." },
    { "id": 23, "text": "When systems are automatically generated and maintained, quality is diminished.", "translationAr": "عندما يتم إنشاء الأنظمة وصيانتها تلقائيًا، تقل الجودة.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "On the contrary, automation reduces human error and ensures consistency, which usually *improves* system quality.", "explanationAr": "على العكس من ذلك، تقلل الأتمتة من الخطأ البشري وتضمن الاتساق، مما يؤدي عادةً إلى *تحسين* جودة النظام." },
    { "id": 24, "text": "A business rule is a statement of how a policy is enforced or conducted.", "translationAr": "قاعدة العمل هي بيان لكيفية تنفيذ السياسة أو إجراؤها.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "By defining the 'how', business rules bridge the gap between abstract policy and concrete implementation.", "explanationAr": "من خلال تحديد 'كيفية' التنفيذ، تسد قواعد العمل الفجوة بين السياسة المجردة والتنفيذ العملي." },
    { "id": 25, "text": "While business rules are not redundant, a business rule can refer to another business rule.", "translationAr": "بينما قواعد العمل ليست زائدة عن الحاجة، يمكن لقاعدة عمل أن تشير إلى قاعدة عمل أخرى.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Rules are often hierarchical or interdependent, where one rule's validation depends on another.", "explanationAr": "غالبًا ما تكون القواعد هرمية أو مترابطة، حيث يعتمد التحقق من صحة قاعدة واحدة على قاعدة أخرى." },
    { "id": 26, "text": "A business rule should be internally consistent.", "translationAr": "يجب أن تكون قاعدة العمل متسقة داخليًا.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Consistency is vital; a rule cannot contradict itself or lead to logical deadlocks.", "explanationAr": "الاتساق أمر حيوي؛ لا يمكن للقاعدة أن تناقض نفسها أو تؤدي إلى مآزق منطقية." },
    { "id": 27, "text": "Business rules are formulated from a collection of business ramblings.", "translationAr": "يتم صياغة قواعد العمل من مجموعة من ترهات العمل.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "Rules should be derived from clearly defined policies, not informal 'ramblings'.", "explanationAr": "يجب أن تُشتق القواعد من سياسات محددة بوضوح، وليس من 'ترهات' غير رسمية." },
    { "id": 28, "text": "Data names should always relate to business characteristics.", "translationAr": "يجب أن تتعلق أسماء البيانات دائمًا بخصائص العمل.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Meaningful names (like StudentID instead of S001) make the database easier to understand for everyone.", "explanationAr": "الأسماء ذات المعنى (مثل StudentID بدلاً من S001) تجعل قاعدة البيانات أسهل في الفهم للجميع." },
    { "id": 29, "text": "An example of a term would be the following sentence: \"A student registers for a course.\"", "translationAr": "مثال على المصطلح سيكون الجملة التالية: \"طالب يسجل في دورة\".", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "That sentence is a 'Fact' (a relationship between terms). A 'Term' would be just 'Student' or 'Course'.", "explanationAr": "هذه الجملة هي 'حقيقة' (علاقة بين مصطلحات). أما 'المصطلح' فسيكون مجرد 'طالب' أو 'دورة'." },
    { "id": 30, "text": "A fact is an association between two or more terms.", "translationAr": "الحقيقة هي ارتباط بين مصطلحين أو أكثر.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Facts represent the meaningful connections between entities (e.g., Student *enrolled in* Course).", "explanationAr": "تمثل الحقائق الروابط ذات المعنى بين الكيانات (مثل: طالب *مسجل في* دورة)." },
    { "id": 31, "text": "A good data definition is always accompanied by diagrams, such as the entity‑relationship diagram.", "translationAr": "دائمًا ما يكون تعريف البيانات الجيد مصحوبًا برسوم بيانية، مثل مخطط علاقة الكيان.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "While diagrams are helpful, they are not strictly part of the data *definition* itself, which is text-based.", "explanationAr": "بينما الرسوم البيانية مفيدة، إلا أنها ليست جزءًا من *تعريف* البيانات نفسه بشكل صارم، حيث يكون التعريف نصيًا." },
    { "id": 32, "text": "An entity is a person, place, object, event, or concept in the user environment about which the organization wishes to maintain data.", "translationAr": "الكيان هو شخص أو مكان أو شيء أو حدث أو مفهوم في بيئة المستخدم ترغب المنظمة في الاحتفاظ ببيانات عنه.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "This is the fundamental definition of an entity in data modeling.", "explanationAr": "هذا هو التعريف الأساسي للكيان في نمذجة البيانات." },
    { "id": 33, "text": "A single occurrence of an entity is called an entity instance.", "translationAr": "يسمى الحدوث الفردي للكيان حالة الكيان (entity instance).", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "For example, 'Student' is an entity, and 'Ahmed' is an entity instance.", "explanationAr": "على سبيل المثال، 'طالب' هو كيان، و 'أحمد' هو حالة كيان." },
    { "id": 34, "text": "A subtype is a generic entity that has a relationship with one or more entities at a lower level.", "translationAr": "النمط الفرعي (subtype) هو كيان عام له علاقة بكيان واحد أو أكثر في مستوى أدنى.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "A *Supertype* is the generic entity; a *Subtype* is the specific one at a lower level.", "explanationAr": "النمط الأعلى (*Supertype*) هو الكيان العام؛ أما النمط الفرعي (*Subtype*) فهو الكيان المحدد في مستوى أدنى." },
    { "id": 35, "text": "An entity instance of a subtype represents the same entity instance of the supertype.", "translationAr": "تمثل حالة الكيان للنمط الفرعي نفس حالة الكيان للنمط الأعلى (supertype).", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "A 'Grad Student' (subtype) is still the same 'Student' (supertype). They share the same identity.", "explanationAr": "الطالب 'الخريج' (نمط فرعي) لا يزال هو نفسه 'الطالب' (نمط أعلى). إنهما يتشاركان نفس الهوية." },
    { "id": 36, "text": "A member of a subtype does NOT necessarily have to be a member of the supertype.", "translationAr": "ليس من الضروري أن يكون عضو النمط الفرعي عضوًا في النمط الأعلى.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "Under the inheritance rule, every subtype instance must also be a supertype instance.", "explanationAr": "بموجب قاعدة الوراثة، يجب أن تكون كل حالة نمط فرعي هي أيضاً حالة نمط أعلى." },
    { "id": 37, "text": "Supertype/subtype relationships should be used when the instances of a subtype participate in no relationships which are unique to that subtype.", "translationAr": "يجب استخدام علاقات النمط الأعلى/الفرعي عندما لا تشارك حالات النمط الفرعي في أي علاقات فريدة لهذا النمط الفرعي.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "They should only be used when there *are* unique attributes or relationships for that subtype.", "explanationAr": "يجب استخدامها فقط عندما تكون هناك سمات أو علاقات فريدة لهذا النمط الفرعي." },
    { "id": 38, "text": "One of the major challenges in data modeling is to recognize and clearly represent entities that are almost the same.", "translationAr": "أحد التحديات الرئيسية في نمذجة البيانات هو التعرف على الكيانات المتشابهة تقريبًا وتمثيلها بوضوح.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Identifying overlap between entities helps decide when to use supertypes and subtypes.", "explanationAr": "يساعد تحديد التداخل بين الكيانات في تحديد متى يتم استخدام الأنماط العليا والأنماط الفرعية." },
    { "id": 39, "text": "The total specialization rule states that an entity instance of a supertype is allowed not to belong to any subtype.", "translationAr": "تنص قاعدة التخصص الكامل على أنه يُسمح لحالة الكيان من النمط الأعلى بعدم الانتماء إلى أي نمط فرعي.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "The *Total* specialization rule means it MUST belong to at least one subtype. *Partial* specialization allows it not to belong.", "explanationAr": "قاعدة التخصص *الكامل* تعني أنه يجب أن ينتمي إلى نمط فرعي واحد على الأقل. أما التخصص *الجزئي* فيسمح له بعدم الانتماء." },
    { "id": 40, "text": "Generalization is a top‑down process.", "translationAr": "التعميم (Generalization) هو عملية من الأعلى إلى الأسفل.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "Generalization is bottom-up (finding commonalities in specific entities). Specialization is top-down.", "explanationAr": "التعميم (Generalization) هو عملية من الأسفل إلى الأعلى (إيجاد القواسم المشتركة في كيانات محددة). أما التخصص (Specialization) فهو من الأعلى إلى الأسفل." },
    { "id": 41, "text": "A completeness constraint may specify that each entity of the supertype must be a member of some subtype in the relationship.", "translationAr": "قد يحدد قيد الاكتمال أن كل كيان من النمط الأعلى يجب أن يكون عضوًا في نمط فرعي ما في العلاقة.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "This is the definition of a completeness constraint (total vs partial specialization).", "explanationAr": "هذا هو تعريف قيد الاكتمال (التخصص الكامل مقابل الجزئي)." },
    { "id": 42, "text": "When the total specialization rule is set for a supertype/subtype relationship, one could roughly compare the supertype to an abstract class in object‑oriented programming.", "translationAr": "عند تعيين قاعدة التخصص الكامل لعلاقة نمط أعلى/فرعي، يمكن للمرء مقارنة النمط الأعلى تقريبًا بفئة مجردة (abstract class) في البرمجة كائنية التوجه.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "In an abstract class, you cannot have instances of the class itself; every instance must belong to a concrete derived class (subtype).", "explanationAr": "في الفئة المجردة، لا يمكنك الحصول على عينات من الفئة نفسها؛ بل يجب أن تنتمي كل عينة إلى فئة مشتقة محددة (نمط فرعي)." },
    { "id": 43, "text": "The disjoint rule specifies that if an entity instance of the supertype is a member of one subtype, it MUST simultaneously be a member of another subtype.", "translationAr": "تحدد قاعدة الانفصال (disjoint rule) أنه إذا كانت حالة الكيان من النمط الأعلى عضوًا في نمط فرعي واحد، فيجب أن تكون في نفس الوقت عضوًا في نمط فرعي آخر.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "The disjoint rule means an instance can belong to *at most one* subtype. The *Overlap* rule allows it to belong to multiple simultaneously.", "explanationAr": "قاعدة الانفصال تعني أن الحالة يمكن أن تنتمي إلى *نمط فرعي واحد على الأكثر*. أما قاعدة *التداخل* (Overlap) فهي التي تسمح بالانتماء لعدة أنماط في وقت واحد." },
    { "id": 44, "text": "Data structures include data organized in the form of tables with rows and columns.", "translationAr": "تتضمن هياكل البيانات بيانات منظمة في شكل جداول بصفوف وأعمدة.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "This is the core structure of the Relational Model.", "explanationAr": "هذا هو الهيكل الأساسي للنموذج العلائقي." },
    { "id": 45, "text": "A composite key consists of only one attribute.", "translationAr": "يتكون المفتاح المركب من سمة واحدة فقط.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "A composite key consists of *two or more* attributes that uniquely identify each row.", "explanationAr": "يتكون المفتاح المركب من *سمتين أو أكثر* تحدد بشكل فريد كل صف." },
    { "id": 46, "text": "A primary key is an attribute that uniquely identifies each row in a relation.", "translationAr": "المفتاح الأساسي هو سمة تحدد بشكل فريد كل صف في العلاقة.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "This is the definition of a primary key, ensuring uniqueness for each record.", "explanationAr": "هذا هو تعريف المفتاح الأساسي، الذي يضمن تفرد كل سجل." },
    { "id": 47, "text": "A foreign key is a primary key of a relation that also is a primary key in another relation.", "translationAr": "المفتاح الأجنبي هو مفتاح أساسي لعلاقة وهو أيضًا مفتاح أساسي في علاقة أخرى.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "A foreign key is an attribute (or set of attributes) in one table that refers to the primary key of another table.", "explanationAr": "المفتاح الأجنبي هو سمة (أو مجموعة من السمات) في جدول واحد تشير إلى المفتاح الأساسي لجدول آخر." },
    { "id": 48, "text": "Sample data are useful for developing prototype applications and for testing queries.", "translationAr": "عينة البيانات مفيدة لتطوير تطبيقات النموذج الأولي واختبار الاستعلامات.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Sample data helps validate the database design and application functionality before deployment.", "explanationAr": "تساعد عينات البيانات في التحقق من صحة تصميم قاعدة البيانات ووظائف التطبيق قبل النشر." },
    { "id": 49, "text": "An enterprise key is a foreign key whose value is unique across all relations.", "translationAr": "مفتاح المؤسسة هو مفتاح أجنبي قيمته فريدة عبر جميع العلاقات.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "An enterprise key is a primary key whose value is unique across *all* relations, not a foreign key.", "explanationAr": "مفتاح المؤسسة هو مفتاح أساسي تكون قيمته فريدة عبر *جميع* العلاقات، وليس مفتاحًا أجنبيًا." },
    { "id": 50, "text": "One property of a relation is that each attribute within a relation has a unique name.", "translationAr": "أحد خصائص العلاقة هو أن كل سمة داخل العلاقة لها اسم فريد.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "This ensures that each column can be distinctly identified and referenced.", "explanationAr": "يضمن هذا أن كل عمود يمكن تحديده والإشارة إليه بشكل مميز." },
    { "id": 51, "text": "There can be multivalued attributes in a relation.", "translationAr": "يمكن أن تكون هناك سمات متعددة القيم في العلاقة.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "Relations must be in First Normal Form (1NF), which prohibits multivalued attributes. Every intersection of a row and column must contain an atomic value.", "explanationAr": "يجب أن تكون العلاقات في الصيغة الطبيعية الأولى (1NF)، والتي تحظر السمات متعددة القيم. يجب أن يحتوي كل تقاطع لصف وعمود على قيمة ذرية (Atomic)." },
    { "id": 52, "text": "The columns of a relation can be interchanged without changing the meaning or use of the relation.", "translationAr": "يمكن تبديل أعمدة العلاقة دون تغيير معنى أو استخدام العلاقة.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "In a formal relation, the order of columns (attributes) is irrelevant.", "explanationAr": "في العلاقة الرسمية، ترتيب الأعمدة (السمات) ليس له أهمية." },
    { "id": 53, "text": "Unlike columns, the rows of a relation may not be interchanged and must be stored in one sequence.", "translationAr": "على عكس الأعمدة، قد لا يتم تبديل صفوف العلاقة ويجب تخزينها في تسلسل واحد.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "The order of rows (tuples) is also irrelevant in a relational database.", "explanationAr": "ترتيب الصفوف (الجمل) ليس له أهمية أيضاً في قاعدة البيانات العلائقية." },
    { "id": 54, "text": "All values that appear in a column of a relation must be taken from the same domain.", "translationAr": "يجب أخذ جميع القيم التي تظهر في عمود العلاقة من نفس المجال (domain).", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "A column represents a single attribute, so all its values must belong to the same domain (data type).", "explanationAr": "يمثل العمود سمة واحدة، لذا يجب أن تنتمي جميع قيمه إلى نفس النطاق (نوع البيانات)." },
    { "id": 55, "text": "View integration is the process of merging relations together.", "translationAr": "تكامل العرض هو عملية دمج العلاقات معًا.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "View integration is the process of combining different user views into a single, coherent conceptual schema. It's not about merging relations directly.", "explanationAr": "تكامل العرض هو عملية دمج وجهات نظر المستخدم المختلفة في مخطط مفاهيمي واحد ومتماسك. لا يتعلق الأمر بدمج العلاقات مباشرة." },
    { "id": 56, "text": "A synonym is an attribute that may have more than one meaning.", "translationAr": "المرادف هو سمة قد يكون لها أكثر من معنى.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "A synonym refers to two different names for the same attribute. An attribute with more than one meaning is an 'homonym'.", "explanationAr": "يشير المرادف إلى اسمين مختلفين لنفس السمة. السمة التي لها أكثر من معنى تسمى 'متجانسة'." },
    { "id": 57, "text": "When two or more attributes describe the same characteristic of an entity, they are synonyms.", "translationAr": "عندما تصف سمتان أو أكثر نفس خاصية الكيان، فهما مترادفات.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "This is the definition of a synonym in data modeling context, where different names refer to the same underlying data characteristic.", "explanationAr": "هذا هو تعريف المرادف في سياق نمذجة البيانات، حيث تشير أسماء مختلفة إلى نفس الخاصية الأساسية للبيانات." },
    { "id": 58, "text": "CASE tools can model more complex data relationships, such as ternary relationships.", "translationAr": "يمكن لأدوات CASE نمذجة علاقات بيانات أكثر تعقيدًا، مثل العلاقات الثلاثية.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Computer-Aided Software Engineering (CASE) tools are designed to support various aspects of software development, including complex data modeling.", "explanationAr": "تم تصميم أدوات هندسة البرمجيات بمساعدة الحاسوب (CASE) لدعم جوانب مختلفة من تطوير البرمجيات، بما في ذلك نمذجة البيانات المعقدة." },
    { "id": 59, "text": "When a regular entity type contains a multivalued attribute, two new relations are created.", "translationAr": "عندما يحتوي نوع كيان عادي على سمة متعددة القيم، يتم إنشاء علاقتين جديدتين.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "To resolve a multivalued attribute, a new relation is created for the multivalued attribute, and a foreign key links it back to the original entity.", "explanationAr": "لحل سمة متعددة القيم، يتم إنشاء علاقة جديدة للسمة متعددة القيم، ويربطها مفتاح أجنبي بالكيان الأصلي." },
    { "id": 60, "text": "Requirements for response time, data security, backup and recovery are all requirements for physical design.", "translationAr": "متطلبات وقت الاستجابة وأمن البيانات والنسخ الاحتياطي والاسترداد هي جميعها متطلبات للتصميم المادي.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "These are non-functional requirements that heavily influence the physical implementation choices of a database.", "explanationAr": "هذه متطلبات غير وظيفية تؤثر بشكل كبير على خيارات التنفيذ المادي لقاعدة البيانات." },
    { "id": 61, "text": "One decision in the physical design process is selecting structures.", "translationAr": "أحد القرارات في عملية التصميم المادي هو اختيار الهياكل.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Physical design involves choosing appropriate data structures, file organizations, and access methods to optimize performance and storage.", "explanationAr": "يتضمن التصميم المادي اختيار هياكل البيانات المناسبة، وتنظيم الملفات، وطرق الوصول لتحسين الأداء والتخزين." },
    { "id": 62, "text": "The logical database design always forms the best foundation for grouping attributes in the physical design.", "translationAr": "يشكل تصميم قاعدة البيانات المنطقي دائمًا أفضل أساس لتجميع السمات في التصميم المادي.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "The logical design provides the conceptual blueprint, which is then optimized and translated into physical structures.", "explanationAr": "يوفر التصميم المنطقي المخطط المفاهيمي، والذي يتم بعد ذلك تحسينه وترجمته إلى هياكل مادية." },
    { "id": 63, "text": "Efficient database structures will be beneficial only if queries and the underlying DBMS are tuned to properly use the structures.", "translationAr": "ستكون هياكل قاعدة البيانات الفعالة مفيدة فقط إذا تم ضبط الاستعلامات ونظام إدارة قواعد البيانات الأساسي لاستخدام الهياكل بشكل صحيح.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Even well-designed structures can perform poorly if queries are not optimized or the DBMS is not configured correctly.", "explanationAr": "حتى الهياكل المصممة جيدًا يمكن أن يكون أداؤها ضعيفًا إذا لم يتم تحسين الاستعلامات أو لم يتم تكوين نظام إدارة قواعد البيانات بشكل صحيح." },
    { "id": 64, "text": "Adding notations to the EER diagram regarding data volumes and usage is of no value to the physical design process.", "translationAr": "إضافة ملاحظات إلى مخطط EER فيما يتعلق بأحجام البيانات واستخدامها ليس له أي قيمة لعملية التصميم المادي.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "Data volumes and usage patterns are crucial inputs for physical design decisions, such as indexing, partitioning, and storage allocation.", "explanationAr": "تعد أحجام البيانات وأنماط الاستخدام مدخلات حاسمة لقرارات التصميم المادي، مثل الفهرسة والتقسيم وتخصيص التخزين." },
    { "id": 65, "text": "The smallest unit of named application data is a record.", "translationAr": "أصغر وحدة من بيانات التطبيق المسماة هي السجل.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "The smallest unit of named application data is typically a 'field' or 'attribute', not a record (which is a collection of fields).", "explanationAr": "أصغر وحدة من بيانات التطبيق المسماة هي عادة 'حقل' أو 'سمة'، وليس سجل (وهو مجموعة من الحقول)." },
    { "id": 66, "text": "Security is one advantage of partitioning.", "translationAr": "الأمن هو إحدى مزايا التقسيم (partitioning).", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Partitioning can enhance security by allowing different partitions to have different access controls or be stored in different secure locations.", "explanationAr": "يمكن أن يعزز التقسيم الأمان من خلال السماح لأقسام مختلفة بالحصول على ضوابط وصول مختلفة أو تخزينها في مواقع آمنة مختلفة." },
    { "id": 67, "text": "Reduced uptime is a disadvantage of partitioning.", "translationAr": "تقليل وقت التشغيل هو عيب من عيوب التقسيم.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Partitioning can actually *improve* uptime and availability, as failures in one partition may not affect others, and maintenance can be done on individual partitions.", "explanationAr": "يمكن أن يؤدي التقسيم في الواقع إلى *تحسين* وقت التشغيل والتوافر، حيث قد لا تؤثر الأعطال في قسم واحد على الأقسام الأخرى، ويمكن إجراء الصيانة على أقسام فردية." },
    { "id": 68, "text": "Hash partitioning spreads data evenly across partitions independent of any partition key value.", "translationAr": "يوزع تقسيم الهاش البيانات بالتساوي عبر الأقسام بشكل مستقل عن أي قيمة لمفتاح التقسيم.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Hash partitioning uses a hash function to distribute rows, aiming for an even distribution regardless of the actual data values, which helps prevent hot spots.", "explanationAr": "يستخدم تقسيم الهاش دالة تجزئة لتوزيع الصفوف، بهدف توزيع متساوٍ بغض النظر عن قيم البيانات الفعلية، مما يساعد على منع النقاط الساخنة." },
    { "id": 69, "text": "Free range partitioning is a type of horizontal partitioning in which each partition is defined by a range of values for one or more columns in the normalized table.", "translationAr": "التقسيم بنطاق حر هو نوع من التقسيم الأفقي حيث يتم تحديد كل قسم بنطاق من القيم لعمود واحد أو أكثر في الجدول الطبيعي.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "This describes 'range partitioning', where data is divided based on a specified range of values in a column (e.g., dates, IDs).", "explanationAr": "يصف هذا 'تقسيم النطاق'، حيث يتم تقسيم البيانات بناءً على نطاق محدد من القيم في عمود (مثل التواريخ، المعرفات)." },
    { "id": 70, "text": "Vertical partitioning means distributing the columns of a table into several separate physical records.", "translationAr": "التقسيم العمودي يعني توزيع أعمدة الجدول إلى عدة سجلات مادية منفصلة.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Vertical partitioning splits a table by columns, often to separate frequently accessed columns from less frequently accessed ones, or to improve cache utilization.", "explanationAr": "يقسم التقسيم العمودي الجدول حسب الأعمدة، غالبًا لفصل الأعمدة التي يتم الوصول إليها بشكل متكرر عن تلك التي يتم الوصول إليها بشكل أقل تكرارًا، أو لتحسين استخدام ذاكرة التخزين المؤقت." },
    { "id": 71, "text": "Parallel query processing speed is not significantly different from running queries in a non‑parallel mode.", "translationAr": "سرعة معالجة الاستعلام الموازي لا تختلف بشكل كبير عن تشغيل الاستعلامات في وضع غير موازي.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "Parallelism can significantly speed up large queries by using multiple CPUs/processes simultaneously.", "explanationAr": "يمكن للتوازي تسريع الاستعلامات الكبيرة بشكل كبير من خلال استخدام معالجات أو عمليات متعددة في وقت واحد." },
    { "id": 72, "text": "Along with table scans, other elements of a query can be processed in parallel.", "translationAr": "جنبًا إلى جنب مع عمليات مسح الجدول، يمكن معالجة عناصر أخرى من الاستعلام بالتوازي.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 0, "explanation": "Modern query optimizers can parallelize joins, sorts, and aggregations as well.", "explanationAr": "يمكن لمحركات تحسين الاستعلام الحديثة موازاة عمليات الربط والفرز والتجميع أيضاً." },
    { "id": 73, "text": "The query processor always knows the best way to process a query.", "translationAr": "يعرف معالج الاستعلام دائمًا أفضل طريقة لمعالجة الاستعلام.", "options": ["True", "False"], "translationOptionsAr": ["صح", "خطأ"], "answerIndex": 1, "explanation": "While very sophisticated, query optimizers rely on statistics which might be outdated or incomplete, leading to sub-optimal plans.", "explanationAr": "على الرغم من تطورها الكبير، تعتمد محركات تحسين الاستعلام على إحصائيات قد تكون قديمة أو غير مكتملة، مما يؤدي إلى خطط غير مثالية." }
  ],
  "multipleChoice": [
    { "id": 1, "text": "A database is an organized collection of ________ related data.", "translationAr": "قاعدة البيانات هي مجموعة منظمة من البيانات المرتبطة ________.", "options": ["logically", "physically", "loosely", "badly"], "translationOptionsAr": ["منطقيًا", "ماديًا", "بشكل فضفاض", "بشكل سيء"], "answerIndex": 0, "explanation": "Databases store data that has a logical relationship and common meaning to the users.", "explanationAr": "تخزن قواعد البيانات البيانات التي لها علاقة منطقية ومعنى مشترك للمستخدمين." },
    { "id": 2, "text": "Older systems that often contain data of poor quality are called ________ systems.", "translationAr": "الأنظمة القديمة التي غالبًا ما تحتوي على بيانات ذات جودة رديئة تسمى أنظمة ________.", "options": ["controlled", "legacy", "database", "mainframe"], "translationOptionsAr": ["محكومة", "قديمة (legacy)", "قاعدة بيانات", "إطار رئيسي"], "answerIndex": 1, "explanation": "Legacy systems are older, often outdated systems that are still in use, typically characterized by poor data quality and integration challenges.", "explanationAr": "الأنظمة القديمة هي أنظمة أقدم، غالبًا ما تكون قديمة، ولا تزال قيد الاستخدام، وتتميز عادةً بجودة بيانات رديئة وتحديات التكامل." },
    { "id": 3, "text": "Program‑data dependence is caused by:", "translationAr": "اعتماد البيانات على البرنامج ناتج عن:", "options": ["file descriptions being stored in each database application.", "data descriptions being stored on a server.", "data descriptions being written into programming code.", "data cohabiting with programs."], "translationOptionsAr": ["تخزين أوصاف الملفات في كل تطبيق قاعدة بيانات.", "تخزين أوصاف البيانات على الخادم.", "كتابة أوصاف البيانات في كود البرمجة.", "تعايش البيانات مع البرامج."], "answerIndex": 2 },
    { "id": 4, "text": "Because applications are often developed independently in file processing systems:", "translationAr": "بما أن التطبيقات غالبًا ما يتم تطويرها بشكل مستقل في أنظمة معالجة الملفات:", "options": ["the data is always non‑redundant.", "unplanned duplicate data files are the rule rather than the exception.", "data can always be shared with others.", "there is a large volume of file I/O."], "translationOptionsAr": ["البيانات دائمًا غير زائدة عن الحاجة.", "ملفات البيانات المكررة غير المخطط لها هي القاعدة وليست الاستثناء.", "يمكن دائمًا مشاركة البيانات مع الآخرين.", "هناك حجم كبير من مدخلات ومخرجات الملفات."], "answerIndex": 1 },
    { "id": 5, "text": "Relational databases establish the relationships between entities by means of common fields included in a file called a(n):", "translationAr": "تنشئ قواعد البيانات العلائقية العلاقات بين الكيانات عن طريق حقول مشتركة مضمنة في ملف يسمى:", "options": ["entity", "relationship", "relation", "association"], "translationOptionsAr": ["كيان", "علاقة", "علاقة (relation)", "ارتباط"], "answerIndex": 2 },
    { "id": 6, "text": "A(n) ________ is often developed by identifying a form or report that a user needs on a regular basis.", "translationAr": "غالبًا ما يتم تطوير ________ من خلال تحديد نموذج أو تقرير يحتاجه المستخدم بشكل منتظم.", "options": ["enterprise view", "reporting document", "user view", "user snapshot"], "translationOptionsAr": ["عرض مؤسسة", "وثيقة إبلاغ", "عرض مستخدم", "لقطة مستخدم"], "answerIndex": 2 },
    { "id": 7, "text": "A graphical system used to capture the nature and relationships among data is called a(n):", "translationAr": "يسمى النظام الرسومي المستخدم لالتقاط طبيعة العلاقات بين البيانات ________.", "options": ["XML data model", "hypertext graphic", "relational database", "data model"], "translationOptionsAr": ["نموذج بيانات XML", "رسومات نص تشعبي", "قاعدة بيانات علائقية", "نموذج بيانات"], "answerIndex": 3 },
    { "id": 8, "text": "Data that describe the properties of other data are:", "translationAr": "البيانات التي تصف خصائص البيانات الأخرى هي:", "options": ["relationships", "logical", "physical", "metadata"], "translationOptionsAr": ["علاقات", "منطقية", "مادية", "بيانات وصفية (metadata)"], "answerIndex": 3 },
    { "id": 9, "text": "All of the following are properties of metadata EXCEPT:", "translationAr": "كل ما يلي من خصائص البيانات الوصفية ما عدا:", "options": ["data definitions", "processing logic", "rules or constraints", "data structures"], "translationOptionsAr": ["تعاريف البيانات", "منطق المعالجة", "القواعد أو القيود", "هياكل البيانات"], "answerIndex": 1 },
    { "id": 10, "text": "A person, place, object, event, or concept about which the organization wishes to maintain data is called a(n):", "translationAr": "يسمى الشخص أو المكان أو الشيء أو الحدث أو المفهوم الذي ترغب المنظمة في الاحتفاظ ببيانات عنه ________.", "options": ["relationship", "object", "attribute", "entity"], "translationOptionsAr": ["علاقة", "كائن", "سمة", "كيان"], "answerIndex": 3 },
    { "id": 11, "text": "Relationships are established between entities in a well‑structured database so that the desired information can be retrieved.", "translationAr": "يتم إنشاء علاقات بين الكيانات في قاعدة بيانات جيدة التنظيم بحيث يمكن استرجاع المعلومات المطلوبة.", "options": ["Entities", "Relationships", "Lines", "Ties"], "translationOptionsAr": ["الكيانات", "العلاقات", "الخطوط", "الروابط"], "answerIndex": 1 },
    { "id": 12, "text": "All of the following are primary purposes of a database management system (DBMS) EXCEPT:", "translationAr": "كل ما يلي من الأغراض الأساسية لنظام إدارة قواعد البيانات (DBMS) ما عدا:", "options": ["creating data", "updating data", "storing data", "providing an integrated development environment"], "translationOptionsAr": ["إنشاء البيانات", "تحديث البيانات", "تخزين البيانات", "توفير بيئة تطوير متكاملة"], "answerIndex": 3 },
    { "id": 13, "text": "With the database approach, data descriptions are stored in a central location known as a:", "translationAr": "مع نهج قاعدة البيانات، يتم تخزين أوصاف البيانات في موقع مركزي يعرف باسم:", "options": ["server", "mainframe", "PC", "repository"], "translationOptionsAr": ["خادم", "إطار رئيسي", "كمبيوتر شخصي", "مستودع (repository)"], "answerIndex": 3 },
    { "id": 14, "text": "A user view is:", "translationAr": "عرض المستخدم هو:", "options": ["what a user sees when he or she looks out the window.", "a table or set of tables.", "a logical description of some portion of the database.", "a procedure stored on the server."], "translationOptionsAr": ["ما يراه المستخدم عندما ينظر من النافذة.", "جدول أو مجموعة من الجداول.", "وصف منطقي لجزء من قاعدة البيانات.", "إجراء مخزن على الخادم."], "answerIndex": 2 },
    { "id": 15, "text": "Which organizational function should set database standards?", "translationAr": "أي وظيفة تنظيمية يجب أن تضع معايير قاعدة البيانات؟", "options": ["Management", "Application development", "Technical services", "Database Administration"], "translationOptionsAr": ["الإدارة", "تطوير التطبيقات", "الخدمات التقنية", "إدارة قواعد البيانات"], "answerIndex": 3 },
    { "id": 16, "text": "________ is a tool even non‑programmers can use to access information from a database.", "translationAr": "________ هي أداة يمكن حتى لغير المبرمجين استخدامها للوصول إلى المعلومات من قاعدة البيانات.", "options": ["ODBC", "Structured query language", "ASP", "Data manipulation query language"], "translationOptionsAr": ["ODBC", "لغة الاستعلام المهيكلة (SQL)", "ASP", "لغة استعلام معالجة البيانات"], "answerIndex": 1 },
    { "id": 17, "text": "Which of the following is NOT an advantage of database systems?", "translationAr": "أي مما يلي ليس من مزايا أنظمة قواعد البيانات؟", "options": ["Redundant data", "Program‑data independence", "Better data quality", "Reduced program maintenance"], "translationOptionsAr": ["بيانات زائدة عن الحاجة", "استقلالية البرنامج والبيانات", "جودة بيانات أفضل", "تقليل صيانة البرامج"], "answerIndex": 0 },
    { "id": 18, "text": "The most common source of database failures in organizations is:", "translationAr": "المصدر الأكثر شيوعًا لفشل قواعد البيانات في المنظمات هو:", "options": ["lack of planning.", "inadequate budget.", "inadequate hardware.", "failure to implement a strong database administration function."], "translationOptionsAr": ["نقص التخطيط.", "ميزانية غير كافية.", "أجهزة غير كافية.", "الفشل في تنفيذ وظيفة قوية لإدارة قواعد البيانات."], "answerIndex": 0 },
    { "id": 11, "text": "Which of the following is NOT a characteristic of the database approach?", "translationAr": "أي مما يلي لا يعتبر من خصائص نهج قاعدة البيانات؟", "options": ["Data redundancy is eliminated", "Data is shared among multiple applications", "Program-data dependence", "Improved data integrity"], "translationOptionsAr": ["يتم التخلص من تكرار البيانات", "تتم مشاركة البيانات بين تطبيقات متعددة", "اعتماد البيانات على البرنامج", "تحسين سلامة البيانات"], "answerIndex": 2, "explanation": "Program-data independence is a goal, whereas program-data *dependence* is a characteristic of file processing systems.", "explanationAr": "استقلالية البيانات عن البرنامج هي هدف، بينما *اعتماد* البيانات على البرنامج هو سمة من سمات أنظمة معالجة الملفات." },
    { "id": 12, "text": "Physical independence is the ability to change the _______________ without affecting the logical schema.", "translationAr": "الاستقلالية المادية هي القدرة على تغيير _______________ دون التأثير على المخطط المنطقي.", "options": ["logical schema", "physical schema", "conceptual schema", "none of the above"], "translationOptionsAr": ["المخطط المنطقي", "المخطط المادي", "المخطط المفاهيمي", "لاشيء مما سبق"], "answerIndex": 1, "explanation": "Physical independence allows you to modify storage structures or file organizations without changing the application's view of the data.", "explanationAr": "تسمح الاستقلالية المادية بتعديل هياكل التخزين أو تنظيم الملفات دون تغيير نظرة التطبيق للبيانات." },
    { "id": 13, "text": "The ___________________ is a set of programs used to manage and query a database.", "translationAr": "___________________ هو مجموعة من البرامج المستخدمة لإدارة واستعلام قاعدة البيانات.", "options": ["Database context", "Database Management System (DBMS)", "Database administrator", "Query processor"], "translationOptionsAr": ["سياق قاعدة البيانات", "نظام إدارة قواعد البيانات (DBMS)", "مسؤول قاعدة البيانات", "معالج الاستعلام"], "answerIndex": 1, "explanation": "A DBMS is the software interface between the user and the database.", "explanationAr": "نظام إدارة قواعد البيانات (DBMS) هو الواجهة البرمجية بين المستخدم وقاعدة البيانات." },
    { "id": 14, "text": "Redundant data can lead to ________.", "translationAr": "البيانات المكررة يمكن أن تؤدي إلى ________.", "options": ["Data inconsistency", "Wasted storage space", "Maintenance problems", "All of the above"], "translationOptionsAr": ["عدم اتساق البيانات", "إهدار مساحة التخزين", "مشاكل الصيانة", "كل ما سبق"], "answerIndex": 3, "explanation": "Redundancy causes anomalies and waste, which is why normalization is important.", "explanationAr": "يؤدي التكرار إلى حدوث شذوذ وهدر، ولهذا السبب يعد التطبيع (Normalization) أمراً مهماً." },
    { "id": 15, "text": "Data integrity refers to the ___________________ of the data.", "translationAr": "سلامة البيانات تشير إلى ___________________ الخاصة بالبيانات.", "options": ["accuracy and consistency", "security", "privacy", "none of the above"], "translationOptionsAr": ["دقة واتساق", "أمن", "خصوصية", "لاشيء مما سبق"], "answerIndex": 0, "explanation": "Integrity ensures that data is reliable and reflects reality accurately.", "explanationAr": "تضمن السلامة أن البيانات موثوقة وتعكس الواقع بدقة." },
    { "id": 16, "text": "A primary key should be:", "translationAr": "يجب أن يكون المفتاح الأساسي:", "options": ["unique", "not null", "minimal", "all of the above"], "translationOptionsAr": ["فريداً", "ليس فارغاً (not null)", "بالحد الأدنى (minimal)", "كل ما سبق"], "answerIndex": 3, "explanation": "A primary key must uniquely identify rows, cannot be empty, and should be small for performance.", "explanationAr": "يجب أن يحدد المفتاح الأساسي الصفوف بشكل فريد، ولا يمكن أن يكون فارغاً، ويجب أن يكون صغيراً لضمان الأداء." },
    { "id": 17, "text": "A(n) ________ is an attribute that can be used to uniquely identify an entity instance.", "translationAr": "________ هو سمة يمكن استخدامها لتحديد حالة الكيان بشكل فريد.", "options": ["identifier", "descriptor", "locator", "none of the above"], "translationOptionsAr": ["معرف (identifier)", "واصف", "محدد مكان", "لاشيء مما سبق"], "answerIndex": 0, "explanation": "Identifiers (like ID numbers) serve as primary keys in most models.", "explanationAr": "تعمل المعرفات (مثل أرقام الهوية) كمفاتيح أساسية في معظم النماذج." },
    { "id": 18, "text": "Which normal form deals with partial functional dependencies?", "translationAr": "أي صيغة طبيعية تتعامل مع التبعيات الوظيفية الجزئية؟", "options": ["First", "Second", "Third", "BCNF"], "translationOptionsAr": ["الأولى", "الثانية", "الثالثة", "BCNF"], "answerIndex": 1, "explanation": "2NF is reached by removing partial dependencies on the primary key.", "explanationAr": "يتم الوصول إلى الصيغة الطبيعية الثانية (2NF) عن طريق إزالة التبعات الجزئية على المفتاح الأساسي." },
    { "id": 19, "text": "Which normal form deals with transitive dependencies?", "translationAr": "أي صيغة طبيعية تتعامل مع التبعات المتعدية؟", "options": ["First", "Second", "Third", "BCNF"], "translationOptionsAr": ["الأولى", "الثانية", "الثالثة", "BCNF"], "answerIndex": 2, "explanation": "3NF is reached by removing non-key attributes that depend on other non-key attributes.", "explanationAr": "يتم الوصول إلى الصيغة الطبيعية الثالثة (3NF) عن طريق إزالة السمات غير المفتاحية التي تعتمد على سمات أخرى غير مفتاحية." },
    { "id": 20, "text": "The _______________ statement is used to retrieve data from a database.", "translationAr": "يستخدم بيان _______________ لاسترداد البيانات من قاعدة البيانات.", "options": ["INSERT", "UPDATE", "DELETE", "SELECT"], "translationOptionsAr": ["INSERT", "UPDATE", "DELETE", "SELECT"], "answerIndex": 3, "explanation": "SELECT is the primary DML statement for querying data.", "explanationAr": "SELECT هو البيان الأساسي في لغة معالجة البيانات (DML) لاستعلام البيانات." },
    { "id": 21, "text": "The logical representation of an organization's data is called a(n):", "translationAr": "يسمى التمثيل المنطقي لبيانات المنظمة ________.", "options": ["database model", "entity‑relationship model", "relationship systems design", "database entity diagram"], "translationOptionsAr": ["نموذج قاعدة بيانات", "نموذج علاقة الكيانات (E-R)", "تصميم أنظمة العلاقات", "مخطط كيان قاعدة البيانات"], "answerIndex": 1 },
    { "id": 22, "text": "A good data definition will describe all of the characteristics of a data object EXCEPT:", "translationAr": "سوف يصف تعريف البيانات الجيد جميع خصائص كائن البيانات ما عدا:", "options": ["subtleties", "examples", "who determines the value of the data", "who can delete the data"], "translationOptionsAr": ["التفاصيل الدقيقة", "الأمثلة", "من يحدد قيمة البيانات", "من يمكنه حذف البيانات"], "answerIndex": 0 },
    { "id": 23, "text": "A fact is an association between two or more:", "translationAr": "الحقيقة هي ارتباط بين اثنين أو أكثر من:", "options": ["words", "terms", "facts", "nuggets"], "translationOptionsAr": ["كلمات", "مصطلحات", "حقائق", "قطع ذهبية"], "answerIndex": 1 },
    { "id": 24, "text": "Data modeling may be the most important part of the systems development process because:", "translationAr": "قد تكون نمذجة البيانات أهم جزء في عملية تطوير الأنظمة لأن:", "options": ["data characteristics are important in the design of programs and other systems components.", "the data in a system are generally less complex than processes and play a central role in development.", "data are less stable than processes.", "it is the easiest."], "translationOptionsAr": ["خصائص البيانات مهمة في تصميم البرامج ومكونات الأنظمة الأخرى.", "البيانات في النظام أقل تعقيدًا بشكل عام من العمليات وتلعب دورًا مركزيًا في التطوير.", "البيانات أقل استقرارًا من العمليات.", "إنها الأسهل."], "answerIndex": 0 },
    { "id": 25, "text": "The most common types of entities are:", "translationAr": "أكثر أنواع الكيانات شيوعًا هي:", "options": ["strong entities", "weak entities", "associative entities", "smush entities"], "translationOptionsAr": ["الكيانات القوية", "الكيانات الضعيفة", "الكيانات المرتبطة", "كيانات مهشمة"], "answerIndex": 0 },
    { "id": 26, "text": "In an E‑R diagram, there are/is ________ business rule(s) for every relationship.", "translationAr": "في مخطط E-R، يوجد ________ قواعد عمل لكل علاقة.", "options": ["two", "three", "one", "zero"], "translationOptionsAr": ["اثنان", "ثلاثة", "واحد", "صفر"], "answerIndex": 0 },
    { "id": 27, "text": "Business policies and rules govern all of the following EXCEPT:", "translationAr": "تحكم سياسات وقواعد العمل كل ما يلي ما عدا:", "options": ["managing employees", "creating data", "updating data", "removing data"], "translationOptionsAr": ["إدارة الموظفين", "إنشاء البيانات", "تحديث البيانات", "إزالة البيانات"], "answerIndex": 0 },
    { "id": 28, "text": "A ________ defines or constrains some aspect of the business.", "translationAr": "يحدد أو يقيد الـ ________ جانبًا من جوانب العمل.", "options": ["business constraint", "business structure", "business control", "business rule"], "translationOptionsAr": ["قيد عمل", "هيكل عمل", "رقابة عمل", "قاعدة عمل"], "answerIndex": 3 },
    { "id": 29, "text": "Which of the following is NOT a characteristic of a good business rule?", "translationAr": "أي مما يلي ليس من خصائص قاعدة العمل الجيدة؟", "options": ["Declarative", "Atomic", "Inconsistent", "Expressible"], "translationOptionsAr": ["تقريرية", "ذرية (atomic)", "غير متسقة", "قابلة للتعبير"], "answerIndex": 2 },
    { "id": 30, "text": "Which of the following is NOT a good characteristic of a data name?", "translationAr": "أي مما يلي ليس من الخصائص الجيدة لاسم البيانات؟", "options": ["Relates to business characteristics", "Readable", "Repeatable", "Relates to a technical characteristic of the system"], "translationOptionsAr": ["يتعلق بخصائص العمل", "قابل للقراءة", "قابل للتكرار", "يتعلق بخاصية تقنية للنظام"], "answerIndex": 3 },
    { "id": 31, "text": "The property by which subtype entities possess the values of all attributes of a supertype is called:", "translationAr": "الخاصية التي تمتلك من خلالها كيانات النمط الفرعي قيم جميع سمات النمط الأعلى تسمى:", "options": ["hierarchy reception", "class management", "attribute inheritance", "generalization"], "translationOptionsAr": ["استقبال هرمي", "إدارة الفئات", "وراثة السمات", "التعميم"], "answerIndex": 2 },
    { "id": 32, "text": "Which of the following is a generic entity type that has a relationship with one or more subtypes?", "translationAr": "أي مما يلي هو نوع كيان عام له علاقة بنمط فرعي واحد أو أكثر؟", "options": ["Megatype", "Supertype", "Subgroup", "Class"], "translationOptionsAr": ["نمط ضخم", "نمط أعلى (supertype)", "مجموعة فرعية", "فئة"], "answerIndex": 1 },
    { "id": 33, "text": "An entity cluster can be formed by:", "translationAr": "يمكن تكوين عنقود كيانات من خلال:", "options": ["deleting a supertype and its subtype.", "combining metadata.", "combining a strong entity and its weak entities.", "deleting metadata."], "translationOptionsAr": ["حذف نمط أعلى ونمطه الفرعي.", "دمج البيانات الوصفية.", "دمج كيان قوي وكياناته الضعيفة.", "حذف البيانات الوصفية."], "answerIndex": 2 },
    { "id": 34, "text": "Packaged data models:", "translationAr": "نماذج البيانات المعلبة (packaged):", "options": ["are ready to use right out of the box.", "require customization.", "allow partial specialization.", "cannot be used for most applications."], "translationOptionsAr": ["جاهزة للاستخدام مباشرة.", "تتطلب تخصيصًا.", "تسمح بالتخصص الجزئي.", "لا يمكن استخدامها لمعظم التطبيقات."], "answerIndex": 1 },
    { "id": 35, "text": "Which of the following is true of packaged data models?", "translationAr": "أي مما يلي صحيح بالنسبة لنماذج البيانات المعلبة؟", "options": ["Relationships are connected to the highest‑level entity type in an order that makes sense.", "All subtype/supertype relationships follow the total specialization and disjoint rules.", "No entities on the many sides of a relationship can be weak.", "All weak entities are considered strong."], "translationOptionsAr": ["العلاقات مرتبطة بنوع الكيان في أعلى مستوى بترتيب منطقي.", "تتبع جميع علاقات النمط الفرعي/الأعلى قواعد التخصص الكامل والانفصال.", "لا يمكن لأي كيانات في الجوانب المتعددة من العلاقة أن تكون ضعيفة.", "تعتبر جميع الكيانات الضعيفة قوية."], "answerIndex": 0 },
    { "id": 36, "text": "A generic or template data model that can be reused as a starting point for a data modeling project is called a(n):", "translationAr": "يسمى نموذج بيانات عام أو قالب يمكن إعادة استخدامه كنقطة بداية لمشروع نمذجة بيانات ________.", "options": ["packaged data model.", "universal data model.", "enterprise data model.", "collection data model."], "translationOptionsAr": ["نموذج بيانات معلب", "نموذج بيانات عالمي", "نموذج بيانات مؤسسة", "نموذج بيانات مجموعة"], "answerIndex": 0 },
    { "id": 37, "text": "Using a packaged data model, projects take less time and cost because:", "translationAr": "باستخدام نموذج بيانات معلب، تستغرق المشاريع وقتًا وتكلفة أقل لأن:", "options": ["less personnel are required.", "essential components and structures are already defined.", "there is more time taken to model the enterprise.", "packaged data models only run in Oracle."], "translationOptionsAr": ["مطلوب عدد أقل من الموظفين.", "المكونات والهياكل الأساسية محددة بالفعل.", "يستغرق نمذجة المؤسسة وقتًا أطول.", "نماذج البيانات المعلبة تعمل فقط في أوراكل."], "answerIndex": 1 },
    { "id": 38, "text": "All of the following are advantages of packaged data models EXCEPT:", "translationAr": "كل ما يلي من مزايا نماذج البيانات المعلبة ما عدا:", "options": ["packaged data models can be built using proven components evolved from cumulative experiences.", "projects take less time and cost less.", "the data model is easier to evolve.", "more one‑to‑one relationships give the data model more flexibility."], "translationOptionsAr": ["يمكن بناء نماذج البيانات المعلبة باستخدام مكونات مثبتة تطورت من تجارب تراكمية.", "تستغرق المشاريع وقتًا وتكلفة أقل.", "يسهل تطوير نموذج البيانات.", "المزيد من علاقات واحد لواحد يعطي نموذج البيانات مرونة أكبر."], "answerIndex": 3 },
    { "id": 39, "text": "All of the following are steps to using a packaged data model EXCEPT:", "translationAr": "كل ما يلي من خطوات استخدام نموذج بيانات معلب ما عدا:", "options": ["identify the parts of the data model that apply to your data modeling situation.", "utilize all business rules that come with the packaged data model.", "rename the identified data elements.", "map data to be used in packages with existing data in the current databases."], "translationOptionsAr": ["تحديد أجزاء نموذج البيانات التي تنطبق على حالة نمذجة البيانات الخاصة بك.", "استخدام جميع قواعد العمل التي تأتي مع نموذج البيانات المعلب.", "إعادة تسمية عناصر البيانات المحددة.", "ربط البيانات المستخدمة في الحزم بالبيانات الموجودة في قواعد البيانات الحالية."], "answerIndex": 1 },
    { "id": 40, "text": "When identifying the parts of the packaged data model that apply to your organization, one should first start with:", "translationAr": "عند تحديد أجزاء نموذج البيانات المعلب التي تنطبق على منظمتك، يجب أن تبدأ أولاً بـ:", "options": ["entities", "attributes", "primary keys", "relationships"], "translationOptionsAr": ["الكيانات", "السمات", "المفاتيح الأساسية", "العلاقات"], "answerIndex": 0 },
    { "id": 41, "text": "The third step in the data modeling process with a packaged data model is:", "translationAr": "الخطوة الثالثة في عملية نمذجة البيانات باستخدام نموذج بيانات معلب هي:", "options": ["rename identified data elements.", "rename relationships.", "map data to be used from package to data in current databases.", "interview users."], "translationOptionsAr": ["إعادة تسمية عناصر البيانات المحددة.", "إعادة تسمية العلاقات.", "ربط البيانات المستخدمة من الحزمة بالبيانات في قواعد البيانات الحالية.", "مقابلة المستخدمين."], "answerIndex": 2 },
    { "id": 42, "text": "________ database specification indicates all the parameters for data storage that are then input to database implementation.", "translationAr": "تشير مواصفات قاعدة البيانات ________ إلى جميع معلمات تخزين البيانات التي يتم إدخالها بعد ذلك لتنفيذ قاعدة البيانات.", "options": ["Logical", "Physical", "Schematic", "Conceptual"], "translationOptionsAr": ["منطقية", "مادية", "تخطيطية", "مفاهيمية"], "answerIndex": 1 },
    { "id": 43, "text": "A form of database specification which maps conceptual requirements is called:", "translationAr": "يسمى شكل مواصفات قاعدة البيانات الذي يربط بين المتطلبات المفاهيمية ________.", "options": ["logical specifications", "response specifications", "security specifications", "physical specifications"], "translationOptionsAr": ["مواصفات منطقية", "مواصفات الاستجابة", "مواصفات الأمان", "مواصفات مادية"], "answerIndex": 0 },
    { "id": 44, "text": "Data is represented in the form of:", "translationAr": "يتم تمثيل البيانات في شكل:", "options": ["data trees", "tables", "data notes", "chairs"], "translationOptionsAr": ["أشجار بيانات", "جداول", "ملاحظات بيانات", "كراسي"], "answerIndex": 1 },
    { "id": 45, "text": "A two-dimensional table of data sometimes is called a:", "translationAr": "يسمى الجدول ثنائي الأبعاد للبيانات أحيانًا ________.", "options": ["group", "set", "declaration", "relation"], "translationOptionsAr": ["مجموعة", "مجموعة (set)", "تصريح", "علاقة (relation)"], "answerIndex": 3 },
    { "id": 46, "text": "________ is a component of the relational data model included to specify business rules to maintain the integrity of data when they are manipulated.", "translationAr": "________ هو مكون في نموذج البيانات العلائقية مضمن لتحديد قواعد العمل للحفاظ على سلامة البيانات عند معالجتها.", "options": ["Business rule constraint", "Data integrity", "Business integrity", "Data structure"], "translationOptionsAr": ["قيد قاعدة العمل", "سلامة البيانات", "سلامة العمل", "هيكل البيانات"], "answerIndex": 1 },
    { "id": 47, "text": "An attribute (or attributes) that uniquely identifies each row in a relation is called a:", "translationAr": "تسمى السمة (أو السمات) التي تحدد بشكل فريد كل صف في العلاقة ________.", "options": ["column.", "foreign field.", "primary key.", "duplicate key."], "translationOptionsAr": ["عمود", "حقل أجنبي", "مفتاح أساسي", "مفتاح مكرر"], "answerIndex": 2 },
    { "id": 48, "text": "An attribute in a relation of a database that serves as the primary key of another relation in the same database is called a:", "translationAr": "تسمى السمة في علاقة في قاعدة البيانات والتي تعمل كمفتاح أساسي لعلاقة أخرى في نفس قاعدة البيانات ________.", "options": ["link attribute.", "link key.", "foreign key.", "foreign attribute."], "translationOptionsAr": ["سمة ربط", "مفتاح ربط", "مفتاح أجنبي", "سمة أجنبية"], "answerIndex": 2 },
    { "id": 49, "text": "A primary key whose value is unique across all relations is called a(n):", "translationAr": "يسمى المفتاح الأساسي الذي تكون قيمته فريدة عبر جميع العلاقات ________.", "options": ["global primary key.", "inter‑table primary key.", "enterprise key.", "foreign global key."], "translationOptionsAr": ["مفتاح أساسي عالمي", "مفتاح أساسي بين الجداول", "مفتاح مؤسسة", "مفتاح عالمي أجنبي"], "answerIndex": 2 },
    { "id": 50, "text": "A primary key that consists of more than one attribute is called a:", "translationAr": "يسمى المفتاح الأساسي الذي يتكون من أكثر من سمة واحدة ________.", "options": ["foreign key.", "composite key.", "multivalued key.", "cardinal key."], "translationOptionsAr": ["مفتاح أجنبي", "مفتاح مركب", "مفتاح متعدد القيم", "مفتاح أساسي"], "answerIndex": 1 },
    { "id": 51, "text": "In the SQL language, the ________ statement is used to make table definitions.", "translationAr": "في لغة SQL، تُستخدم عبارة ________ لعمل تعاريف الجداول.", "options": ["create session", "create table", "create index", "select"], "translationOptionsAr": ["create session", "create table", "create index", "select"], "answerIndex": 1 },
    { "id": 52, "text": "A requirement to begin designing physical files and databases is:", "translationAr": "من متطلبات البدء في تصميم الملفات وقواعد البيانات المادية:", "options": ["normalized relations.", "physical tables created.", "implementation complete.", "all datatypes determined."], "translationOptionsAr": ["علاقات مسواة (normalized).", "إنشاء جداول مادية.", "اكتمال التنفيذ.", "تحديد جميع أنواع البيانات."], "answerIndex": 0 },
    { "id": 53, "text": "A key decision in the physical design process is:", "translationAr": "القرار الرئيسي في عملية التصميم المادي هو:", "options": ["ignoring the size of the database.", "selecting structures.", "deciding on the monitor.", "deciding the e‑r diagrams."], "translationOptionsAr": ["تجاهل حجم قاعدة البيانات.", "اختيار الهياكل.", "قرار بشأن الشاشة.", "قرار بشأن مخططات E-R."], "answerIndex": 1 },
    { "id": 54, "text": "Designing physical files requires ________ of where and when data are used in various ways.", "translationAr": "تطلب تصميم الملفات المادية ________ لأين ومتى تبرز الحاجة لاستخدام البيانات بطرق متنوعة.", "options": ["maps", "descriptions", "keys", "hints"], "translationOptionsAr": ["خرائط", "أوصاف", "مفاتيح", "تلميحات"], "answerIndex": 1 },
    { "id": 55, "text": "Database access frequencies are estimated from:", "translationAr": "يتم تقدير ترددات الوصول إلى قاعدة البيانات من:", "options": ["transaction volumes.", "user logins.", "security violations.", "random number generation."], "translationOptionsAr": ["أحجام المعاملات.", "عمليات تسجيل دخول المستخدمين.", "انتهاكات الأمان.", "توليد أرقام عشوائية."], "answerIndex": 0 },
    { "id": 56, "text": "A detailed coding scheme recognized by system software for representing organizational data is called a(n):", "translationAr": "يسمى مخطط الترميز التفصيلي الذي يتعرف عليه برنامج النظام لتمثيل بيانات المنظمة ________.", "options": ["DBMS code.", "data type.", "SQL.", "DB layout."], "translationOptionsAr": ["كود DBMS", "نوع البيانات (data type)", "SQL", "تخطيط DB"], "answerIndex": 1 },
    { "id": 57, "text": "All of the following are objectives when selecting a data type EXCEPT:", "translationAr": "كل ما يلي من أهداف اختيار نوع البيانات ما عدا:", "options": ["represent all possible values.", "improve data integrity.", "support all data manipulations.", "use a lot of storage space."], "translationOptionsAr": ["تمثيل جميع القيم الممكنة.", "تحسين سلامة البيانات.", "دعم جميع عمليات معالجة البيانات.", "استخدام مساحة تخزين كبيرة."], "answerIndex": 3 },
    { "id": 58, "text": "All of the following are valid datatypes in Oracle 11g EXCEPT:", "translationAr": "كل ما يلي من أنواع البيانات الصالحة في Oracle 11g ما عدا:", "options": ["varchar2.", "boolean.", "blob.", "number."], "translationOptionsAr": ["varchar2", "boolean", "blob", "number"], "answerIndex": 1 },
    { "id": 59, "text": "The smallest unit of application data recognized by system software is a:", "translationAr": "أصغر وحدة من بيانات التطبيق يتعرف عليها برنامج النظام هي:", "options": ["field.", "row.", "data type.", "column."], "translationOptionsAr": ["حقل", "صف", "نوع بيانات", "عمود"], "answerIndex": 0 },
    { "id": 60, "text": "An appropriate datatype for one wanting a fixed‑length type for last name would include:", "translationAr": "نوع البيانات المناسب لمن يريد نوعًا بطول ثابت لاسم العائلة سيشمل:", "options": ["VarChar.", "Char.", "Blob.", "Date."], "translationOptionsAr": ["VarChar", "Char", "Blob", "Date"], "answerIndex": 1 }
  ]
}
